# f_quiz

# 1. 당신의 최애 음식은:
# 2. 당신의 최애 동물은:
# 3. 당신의 mbti는:
# 4. 당신의 사는 곳은:

# 출력
# -> 당신이 좋아하는 음식은 ~~ 이고, 최애 동물은 ~~ 이군요!
# -> 당신의 mbti는 ~~이시고, 사는 곳은 ~~ 이시군요!

# food = input("당신의 최애 음식은?")
# animal = input("당신의 최애 동물은?")
# mbti = input("당신의 mbti는?")
# location = input("당신의 사는 곳은?")
#
# print(f"당신이 좋아하는 음식은 {food}이고, 최애 동물은 {animal}이군요! ")
# print(f"당신의 mbti는 {mbti}이고, 사는 곳은 {location}이시군요!")


# ---------------------------------------------------------

# 첫 번째 숫자 입력 :
# 두 번째 숫자 입력 :
# 두 수의 합은 ~~ 입니다 << 라는 출력값을 만들어보자

first = input("첫 번째 숫자")
second = input("두 번째 숫자")
print(f"두 수의 합은 {first+second} 입니다")